Tekla.Structures.Model.BaseWeld.WeldContourEnum
The weld contour.

Tekla.Structures.Model.BaseWeld.WeldContourEnum.WELD_CONTOUR_NONE
No contour.

Tekla.Structures.Model.BaseWeld.WeldContourEnum.WELD_CONTOUR_FLUSH
The flush contour.

Tekla.Structures.Model.BaseWeld.WeldContourEnum.WELD_CONTOUR_CONVEX
The convex contour.

Tekla.Structures.Model.BaseWeld.WeldContourEnum.WELD_CONTOUR_CONCAVE
The concave contour.